### 1. Getting current Datetime in Python.

In [4]:
from datetime import datetime

now = datetime.now()
print(now)
# get current date and time
# now = datetime.now()
# print(now)

# print class
print(type(now))

2023-04-20 15:05:25.886835
<class 'datetime.datetime'>

In [29]:
now

datetime.datetime(2023, 4, 19, 23, 27, 40, 437024)

In [11]:
### Convert it into date.
now_date = now.date()
# print(now.date())

print(now_date)

2023-04-20

In [9]:
print("Year :",now.year)

Year : 2023

### 2. Create user define date

In [12]:
from datetime import date

User_date = date(2021, 2, 10)
print("Date is :", User_date)

date()

Date is : 2021-02-10

In [15]:
print(now_date)
print(User_date)

2023-04-20
2021-02-10

In [18]:
User_date.

2

### 3. Extract Attribute from a date.

In [19]:
# extract attributes
print("Year:", User_date.year)
print("Month:", User_date.month)
print("Day:", User_date.day)

Year: 2021
Month: 2
Day: 10

In [20]:
# extract attributes
print("Hour:", now.hour)
print("seconds:", now.second)
print("Day:", now.minute)

Hour: 15
seconds: 25
Day: 5

### 4. Find the difference in no of days in two dates.

In [37]:
x = now_date - User_date
# print(time_delta)
# type(time_delta)
x

datetime.timedelta(days=799)

In [30]:
now_date

datetime.date(2023, 4, 20)

In [33]:
from datetime import timedelta

In [39]:
now_date + x

datetime.date(2025, 6, 27)

In [34]:
print(now_date + )

2023-04-27

### 5. Find the difference in no of months in two dates.

In [9]:
Total_Months = (now_date.year - User_date.year)*12 + (now_date.month - User_date.month)
Total_Months

26

### 6. Add number 4 weeks to the exisitng date.

In [38]:
from datetime import timedelta

# add 4 weeks in given date
new_date = now_date + timedelta(weeks=4)
print('Future Date After 4 weeks:', new_date)

# add 4 months in given date
new_date = now_date + timedelta()

Future Date After 4 weeks: 2023-05-18

### 7. Subtract 3 month from the exisitng date.

In [40]:
from dateutil.relativedelta import relativedelta
# Subtract 3 monts from the eisting date.
new_date = now_date - relativedelta(months=3)
print('past Date:', new_date)

past Date: 2023-01-20

### 8. Convert String to datetime object.

In [41]:
from datetime import datetime

# Date String in dd/mm/yyyy HH:MM:SS format.
dt_string = "12/06/2021 09:15:32"

# Convert string to datetime object.
dt_object = datetime.strptime(dt_string, "%d/%m/%Y %H:%M:%S")
print(dt_object)

2021-06-12 09:15:32

In [42]:
type(dt_string)

str

In [43]:
type(dt_object)

datetime.datetime

In [18]:
Time_delta_1 = dt_object.date() - User_date
Time_delta_1

datetime.timedelta(days=122)

In [21]:
dt_object.date()

datetime.date(2021, 6, 12)

In [22]:
dt_object.date() + Time_delta_1

datetime.date(2021, 10, 12)

### Pandas - Date Time - Read data and import libraries.

In [44]:
import pandas as pd
url = 'http://bit.ly/uforeports'

# read csv file
df = pd.read_csv(url)
df.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
dtypes: object(5)
memory usage: 712.7+ KB

### Convert String to datetime.

In [46]:
df['Time_date'] =  pd.to_datetime(df['Time'])

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   City             18216 non-null  object
 1   Colors Reported  2882 non-null   object
 2   Shape Reported   15597 non-null  object
 3   State            18241 non-null  object
 4   Time             18241 non-null  object
 5   Time_date        18241 non-null  datetime64[ns]
dtypes: datetime64[ns](1), object(5)
memory usage: 855.2+ KB

In [104]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Time_date
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,1933-04-18 19:00:00

In [48]:
df['date'] = df.Time_date.dt.date

In [49]:
# df['date'] = df.Time_date.dt.date

In [50]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Time_date,date
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,1930-06-01 22:00:00,1930-06-01
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,1930-06-30 20:00:00,1930-06-30
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,1931-02-15 14:00:00,1931-02-15
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,1931-06-01 13:00:00,1931-06-01
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,1933-04-18 19:00:00,1933-04-18

In [52]:
df.Time_date

0       1930-06-01 22:00:00
1       1930-06-30 20:00:00
2       1931-02-15 14:00:00
3       1931-06-01 13:00:00
4       1933-04-18 19:00:00
                ...
18236   2000-12-31 23:00:00
18237   2000-12-31 23:00:00
18238   2000-12-31 23:45:00
18239   2000-12-31 23:45:00
18240   2000-12-31 23:59:00
Name: Time_date, Length: 18241, dtype: datetime64[ns]

In [53]:
type(df.Time[0])
df.Time[0]

print("Type:", type(df.Time[1]))
print("Value:",df.Time[1])

Type: <class 'str'>
Value: 6/30/1930 20:00

In [116]:
print("Type:", type(df.Time_date[1]))
print("Type" , "Value:",df.Time_date[1])

Type: <class 'pandas._libs.tslibs.timestamps.Timestamp'>
Type Value: 1930-06-30 20:00:00

In [123]:
print("Type:", type(df.date[1]))
print("Type" , "Value:",df.date[1])

Type: <class 'datetime.date'>
Type Value: 1930-06-30

### Find day & year difference from current date

In [132]:
df['now'] = datetime.now().date()

In [133]:
df['day_diff'] = now - df.date

In [ ]:
df['day_diff'] = now - df.date

In [54]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Time_date,date
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,1930-06-01 22:00:00,1930-06-01
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,1930-06-30 20:00:00,1930-06-30
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,1931-02-15 14:00:00,1931-02-15
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,1931-06-01 13:00:00,1931-06-01
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,1933-04-18 19:00:00,1933-04-18

In [147]:
df['year'] = df.Time_date.dt.year

In [145]:
df['now_year'] = df.now.apply(lambda x: x.year)

In [150]:
df['year_diff'] = df['now_year'] - df['year']

In [151]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Time_date,date,now,day_diff,now_year,year,year_diff
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,1930-06-01 22:00:00,1930-06-01,2023-04-20,33925 days,2023,1930,93
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,1930-06-30 20:00:00,1930-06-30,2023-04-20,33896 days,2023,1930,93
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,1931-02-15 14:00:00,1931-02-15,2023-04-20,33666 days,2023,1931,92
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,1931-06-01 13:00:00,1931-06-01,2023-04-20,33560 days,2023,1931,92
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,1933-04-18 19:00:00,1933-04-18,2023-04-20,32873 days,2023,1933,90

In [152]:
df['After_a_week'] = df.date + timedelta(weeks=1)

In [153]:
df.head()

,City,Colors Reported,Shape Reported,State,Time,Time_date,date,now,day_diff,now_year,year,year_diff,After_a_week
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,1930-06-01 22:00:00,1930-06-01,2023-04-20,33925 days,2023,1930,93,1930-06-08
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,1930-06-30 20:00:00,1930-06-30,2023-04-20,33896 days,2023,1930,93,1930-07-07
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,1931-02-15 14:00:00,1931-02-15,2023-04-20,33666 days,2023,1931,92,1931-02-22
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,1931-06-01 13:00:00,1931-06-01,2023-04-20,33560 days,2023,1931,92,1931-06-08
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,1933-04-18 19:00:00,1933-04-18,2023-04-20,32873 days,2023,1933,90,1933-04-25